src/toir_cf/src/InformationRegisters/торо_КвалификацияРемонтногоПерсонала/торо_КвалификацияРемонтногоПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_КвалификацияРемонтногоПерсонала</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удаленная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_КвалификацияРемонтногоПерсонала/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Возвращает список квалификаций сотрудника.
//
// Параметры:
//		Параметры - Структура - структура передаваемых параметров.		
//
// Возвращаемое значение:
//		СписокЗначений - список квалификаций сотрудника.
//
Функция ПолучитьСписокКвалификацийСотрудника(Параметры) Экспорт
	Запрос = Новый Запрос;
	ПараметрыОтбор = Параметры.Отбор;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Квалификация КАК Квалификация
	               |ИЗ
	               |	РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних(&Дата, ) КАК торо_КвалификацияРемонтногоПерсоналаСрезПоследних
	               |ГДЕ
	               |	торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Сотрудник = &Сотрудник
	               |	И торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Удаленная = ЛОЖЬ";
	
	Если ПараметрыОтбор.Свойство("Основная") Тогда
		Запрос.Текст = Запрос.Текст + " И торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Основная = &Основная";
		Запрос.УстановитьПараметр("Основная", ПараметрыОтбор.Основная);
			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыОтбор.Сотрудник);
	
	Если ПараметрыОтбор.Свойство("Дата") Тогда
		Если ПараметрыОтбор.Дата = Дата(1, 1, 1, 0, 0, 0) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних(&Дата, )", "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних");
		Иначе
			Запрос.УстановитьПараметр("Дата", ПараметрыОтбор.Дата);
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних(&Дата, )", "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Список = Новый СписокЗначений;
	Пока РезультатЗапроса.Следующий() Цикл
		Список.Добавить(РезультатЗапроса.Квалификация);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

// Возвращает список сотрудников с выбранной квалификацией.
//
// Параметры:
//		Параметры - Структура - структура передаваемых параметров.
//
// Возвращаемое значение:
//		СписокЗначений - список сотрудников.
//
Функция ПолучитьСотрудниковСКвалификацией(Параметры) Экспорт
	Запрос = Новый Запрос;
	ПараметрыОтбор = Параметры.Отбор;
	Запрос.Текст = "ВЫБРАТЬ
	               |	торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних(&Дата, ) КАК торо_КвалификацияРемонтногоПерсоналаСрезПоследних
	               |ГДЕ
	               |	торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Квалификация = &Квалификация
	               |	И торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Удаленная = ЛОЖЬ";
	
	Если ПараметрыОтбор.Свойство("СтрокаПоиска") И Не ПустаяСтрока(ПараметрыОтбор.СтрокаПоиска) Тогда
		Запрос.Текст = Запрос.Текст + " И торо_КвалификацияРемонтногоПерсоналаСрезПоследних.Сотрудник.Наименование ПОДОБНО &Строка";
		ПараметрыОтбор.СтрокаПоиска = ПараметрыОтбор.СтрокаПоиска + "%";
		Запрос.УстановитьПараметр("Строка", ПараметрыОтбор.СтрокаПоиска);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Квалификация", ПараметрыОтбор.Квалификация);
	
	Если ПараметрыОтбор.Дата = Дата(1, 1, 1, 0, 0, 0) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних(&Дата, )", "РегистрСведений.торо_КвалификацияРемонтногоПерсонала.СрезПоследних");
	Иначе
		Запрос.УстановитьПараметр("Дата", ПараметрыОтбор.Дата);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Список = Новый СписокЗначений;
	Пока РезультатЗапроса.Следующий() Цикл
		Список.Добавить(РезультатЗапроса.Сотрудник);
	КонецЦикла;
	Возврат Список;
	
КонецФункции

// Возвращает первого из списка сотрудника с выбранной квалификацией на дату.
//
// Параметры:
//		КвалификацияСсылка - СправочникСсылка - ссылка на квалификацию.
//		Дата - Дата - дата, на которую необходимо отобрать сотрудников с квалификафией.  
//
// Возвращаемое значение:
//		СправочникСсылка - сотрудник с квалификацией.
//
Функция ПолучитьОдногоСотрудникаСКвалификацией(КвалификацияСсылка, Дата) Экспорт
	ПараметрыПолученийДанных = Новый Структура("Отбор");
	ПараметрыПолученийДанных.Вставить("Отбор", Новый Структура("Квалификация,Дата", КвалификацияСсылка, Дата));
	СписокСотрудников = ПолучитьСотрудниковСКвалификацией(ПараметрыПолученийДанных);
	Если СписокСотрудников.Количество() = 1 Тогда
		Возврат СписокСотрудников[0].Значение;
	Иначе
		Возврат Справочники.торо_КвалификацииРемонтногоПерсонала.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции	

// Возвращает квалификацию сотрудника на дату.
//
// Параметры:
//		СотрудникСсылка - СправочникСсылка - ссылка на сотрудника.
//		Дата - Дата - дата, на которую необходимо найти квалификацию сотрудника.  
//
// Возвращаемое значение:
//		СправочникСсылка - квалификация сотрудника.
//
Функция ПолучитьОднуОсновнуюКвалификациюСотрудника(СотрудникСсылка, Дата) Экспорт
	
	ПараметрыПолученияДанных = Новый Структура("Отбор");
	ПараметрыПолученияДанных.Вставить("Отбор", Новый Структура("Сотрудник,Дата,Основная", СотрудникСсылка, Дата, Истина));
	СписокКвалификаций = ПолучитьСписокКвалификацийСотрудника(ПараметрыПолученияДанных);
	Если СписокКвалификаций.Количество() = 1 Тогда
		Возврат СписокКвалификаций[0].Значение;
	Иначе
		Возврат Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции
#КонецОбласти
